
//int number_start,number_end;  

double out (double c,int b)
{
double power=1;
for (int i=1;i<=b;i++)
    power*=c;
}



// Напишите программу, которая запрашивает у пользователя ввод целого числа, а
// затемвыводит все целые числа, начиная с этого числа (и включая его) изаканчи­
// вая числом, которое больше введенного значения на 10 (включая его). (То есть,
// если вводится число 5, то в выводе должны присутствовать числа от 5 до 15.)
// Обеспечьте разделение выводимых значений друг от друга пробелами, символа­
// ми табуляции или символами новой строки